nc: 2
backbone:
    # [from, repeats, module, args]
    - [-1, 1, Conv, [64, 11, 2, 5]] # 0-P1/2, after this, (1, 3, 4096, 4096) -> (1, 64, 2048, 2048)

    - [-1, 1, Conv, [128, 9, 2, 4]] # 1-P2/4, after this, (1, 64, 2048, 2048) -> (1, 128, 1024, 1024)

    - [-1, 1, Conv, [256, 7, 2, 3]] # 2, after this, (1, 128, 1024, 1024) -> (1, 256, 512, 512)

    - [-1, 2, C3k2, [256, True]] # 3

    - [-1, 1, Conv, [512, 5, 2, 2]] # 4, after this, (1, 256, 512, 512) -> (1, 512, 256, 256)

    - [-1, 4, C3k2, [512, True]] # 5

    - [-1, 1, SPPF, [512, 5]] # 6 [out_ch, kernel_size] This module is equivalent to SPP(k=(5, 9, 13)).

head:
    - [-1, 1, nn.AdaptiveAvgPool2d, [1]] # 7
    - [-1, 1, Classify, [nc]] # 8 [nc, anchors, ch]
# model summary: 112 layers, 11,391,042 parameters, 11,391,042 gradients, 92.4 GFLOPs